# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
s1 = pd.Series(np.random.randint(1,high=5,size=100,dtype='int64'))
s2 = pd.Series(np.random.randint(1,high=4,size=100,dtype='int64'))
s3 = pd.Series(np.random.randint(10000,high=30001,size=100,dtype='int64'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [13]:
aaa = pd.concat([s1,s2,s3],axis = 1)
aaa.head(5)

   0  1      2
0  2  1  20163
1  2  2  17067
2  2  3  26838
3  1  2  21379
4  2  1  22227

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [16]:
aaa.rename(columns={'0':'bedrs','1':'bathrs','2':'bedprice_sqr_meterrs'},inplace=True)
aaa

    bedrs  bathrs  price_sqr_meter
0       2       1            20163
1       2       2            17067
2       2       3            26838
3       1       2            21379
4       2       1            22227
..    ...     ...              ...
95      2       3            20983
96      2       1            20566
97      2       1            12612
98      4       3            18032
99      3       3            24456

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [20]:
bigcolumn = pd.concat([s1,s2,s3],axis=0)
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       2
2       2
3       1
4       2
..    ...
95  20983
96  20566
97  12612
98  18032
99  24456

[300 rows x 1 columns]

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [25]:
# bigcolumn.rename(index=[i for i in range(len(bigcolumn))],inplace=True)
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [27]:
bigcolumn.reset_index(drop=True,inplace=True)
bigcolumn

         0
0        2
1        2
2        2
3        1
4        2
..     ...
295  20983
296  20566
297  12612
298  18032
299  24456

[300 rows x 1 columns]